БухЭксп/InformationRegisters/CW_СтатусыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СтатусыДокументов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ВладельцыСтатуса</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/CommonModules/CW_СтатусыДокументовКлиент/Ext/Module.bsl
Процедура ОткрытьФормуРедактированияСтатуса(Форма) Экспорт
	
	ОписаниеОпвещения = Новый ОписаниеОповещения("ОбработатьИзменениеКомментария",ЭтотОбъект,  Форма);
	
	ПоказатьВводСтроки(ОписаниеОпвещения, Форма.СтатусДокументаКомментарий,"Введите комментарий",,Истина);
	
КонецПроцедуры

Процедура ОбработатьИзменениеКомментария(Результат, Форма) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Если Форма.СтатусДокументаКомментарий <> Результат Тогда
			Форма.СтатусДокументаКомментарий = Результат;
			Форма.СтатусДокументаЗаписатьИзменения = Истина;
		КонецЕсли;
		
		Если Форма.СтатусДокументаЗаписатьИзменения и Не Форма.Объект.Ссылка.Пустая() Тогда
			
			ДанныеДляЗаписи = Новый Структура;
			ДанныеДляЗаписи.Вставить("Документ", 		Форма.Объект.Ссылка);
			ДанныеДляЗаписи.Вставить("Комментарий", 	Форма.СтатусДокументаКомментарий);
			
			CW_СтатусыДокументовСервер.ОбновитьКомментарийЗаписиСтатуса(ДанныеДляЗаписи);
		
			
			Форма.СтатусДокументаЗаписатьИзменения = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоказатьИсториюСтатуса(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	Объект 	 = Форма.Объект;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначениеОтбора", 	Объект.Ссылка);
	ПараметрыФормы.Вставить("Отбор", 			Новый Структура("Документ", Объект.Ссылка));
	
	ОткрытьФорму("РегистрСведений.CW_СтатусыДокументов.Форма.ФормаСпискаИстория", ПараметрыФормы, Форма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ОткрытьСтатусДокумента(Форма, Элемент, СтандартнаяОбработка) Экспорт 
	
	СтандартнаяОбработка = Форма.СтатусДокументаСписокВыбора.НайтиПоЗначению(Форма.СтатусДокумента) <> Неопределено;
	
КонецПроцедуры

Процедура СтатусДокументаНачалоВыбора(Форма, Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт 
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Форма.СтатусДокументаСписокВыбора;
	
КонецПроцедуры

Процедура СтатусДокументаАвтоПодбор(Форма, Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Форма.СтатусДокументаСписокВыбора;
	
КонецПроцедуры

Процедура ПриИзмененииСтатусаДокумента(Форма, Элемент) Экспорт
	
	Элементы = Форма.Элементы;
	Объект 	 = Форма.Объект;    
	
	Если Форма.СтатусДокумента.Пустая() Тогда 
		Форма.СтатусДокумента = Форма.СтатусДокументаПредыдущий;
		Возврат;
	КонецЕсли;
	
	Форма.СтатусДокументаЗаписатьИзменения = Истина;
	Если Не Объект.Ссылка.Пустая() Тогда   
		
		Параметры = Новый Структура;
		Параметры.Вставить("Форма", Форма);
		
		Оповещение = Новый ОписаниеОповещения("ПродолжитьУстановкуСтатуса", ЭтотОбъект, Параметры);
		
		Если Форма.СтатусДокументаПредыдущий = Форма.СтатусДокумента Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			ПоказатьВопрос(Оповещение, "Документ уже в статусе "+СокрЛП(Форма.СтатусДокументаПредыдущий)+". Продолжить?", Режим, 0);
		Иначе
			
			ТребуетсяЗаписьДокумента = CW_СтатусыДокументовСервер.ТребуетсяЗаписьДокумента(Объект.Ссылка, Форма.СтатусДокументаПредыдущий, Форма.СтатусДокумента);
			
			Если ТребуетсяЗаписьДокумента Тогда
				Режим = РежимДиалогаВопрос.ДаНет;
				ОповещениеПроведения = Новый ОписаниеОповещения("ОбработатьИзменениеСтатуса", ЭтотОбъект, Параметры);
				ПоказатьВопрос(ОповещениеПроведения, "Документ будет перепроведен. Продолжить?", Режим, 0);
			Иначе
				ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли
	
КонецПроцедуры

Процедура ПродолжитьУстановкуСтатуса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Форма.СтатусДокументаКомментарий = "";
	
	ДанныеДляЗаписи = Новый Структура;
	ДанныеДляЗаписи.Вставить("Документ", 		Параметры.Форма.Объект.Ссылка);
	ДанныеДляЗаписи.Вставить("СтатусДокумента", Параметры.Форма.СтатусДокумента);
	ДанныеДляЗаписи.Вставить("Комментарий", 	Параметры.Форма.СтатусДокументаКомментарий);
	
	CW_СтатусыДокументовСервер.ЗаписатьСтатусДокумента(ДанныеДляЗаписи);
	
	ДанныеСтатуса = CW_СтатусыДокументовСервер.ПолучитьДанныеСтатусаДокумента(Параметры.Форма.Объект.Ссылка);
	
	УстановитьДоступностьЭлементовСтатуса(Параметры.Форма, ДанныеСтатуса);
	
КонецПроцедуры 

Процедура УстановитьДоступностьЭлементовСтатуса(Форма, ДанныеСтатуса)
	
	Форма.СтатусДокумента 				= ДанныеСтатуса.СтатусДокумента;
	Форма.СтатусДокументаКомментарий 	= ДанныеСтатуса.Комментарий;
	Форма.СтатусДокументаПредыдущий 	= ДанныеСтатуса.СтатусДокумента;
	Форма.СтатусДокументаАвтор 			= ДанныеСтатуса.Автор;    
	
	ТекущийПользователь = ПользователиКлиент.ТекущийПользователь();
	ЭтоПолноправныйПользователь = CW_ПраваДоступа.ЭтоПолноправныйПользователь(ТекущийПользователь);
	
	Форма.Элементы.СтатусДокументаИзменить.Доступность = (ТекущийПользователь = ДанныеСтатуса.Автор) или ЭтоПолноправныйПользователь;

КонецПроцедуры  

Процедура ОбработатьИзменениеСтатуса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда    
		ДанныеСтатуса = CW_СтатусыДокументовСервер.ПолучитьДанныеСтатусаДокумента(Параметры.Форма.Объект.Ссылка);
		УстановитьДоступностьЭлементовСтатуса(Параметры.Форма, ДанныеСтатуса);
		Возврат;
	КонецЕсли;
	
	ПродолжитьУстановкуСтатуса(КодВозвратаДиалога.Да, Параметры);
	
	Параметры.Форма.Записать();
	
КонецПроцедуры
